app/Controllers/AdminManagement.php

SELECT *
FROM `users`
---
    public function users()
    {
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return redirect()->to('/login')->with('error', 'Unauthorized');
        }

        $users = $this->userModel->findAll();

SELECT *
FROM `drivers`
WHERE `status` = 'pending'
ORDER BY `created_at` DESC
SELECT *
FROM `drivers`
WHERE `status` = 'approved'
ORDER BY `updated_at` DESC
---
    public function pendingDrivers()
    {
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return redirect()->to('/login')->with('error', 'Unauthorized');
        }

        $drivers = (new DriverModel())
            ->where('status', 'pending')
            ->orderBy('created_at', 'DESC')
            ->findAll();

        $approvedDrivers = (new DriverModel())
            ->where('status', 'approved')
            ->orderBy('updated_at', 'DESC')
            ->findAll();

SELECT *
FROM `drivers`
WHERE `drivers`.`id` = '11'
UPDATE `drivers` SET `status` = 'approved', `is_active` = 1, `updated_at` = '2026-03-04 17:24:52'
WHERE `drivers`.`id` IN ('11')
---
    public function approveDriver($id)
    {
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return $this->response->setStatusCode(403)->setJSON(['error' => 'Unauthorized']);
        }

        $driver = $this->driverModel->find($id);
        if (!$driver) {
            return $this->response->setStatusCode(404)->setJSON(['error' => 'Driver not found']);
        }

        $this->driverModel->update($id, [
            'status' => 'approved',
            'is_active' => 1,
        ]);