app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'restaurant@example.com'
 LIMIT 1
---
    public function attempt()
    {
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required|min_length[6]'
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', $this->validator->getErrors());
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('email', $email)->first();

SELECT *
FROM `restaurants`
WHERE `user_id` = '2'
 LIMIT 1
---
        // if the user is a restaurant owner, look up the related restaurant record
        if ($user['role'] === 'restaurant') {
            $restaurantModel = new \App\Models\RestaurantModel();
            $restaurant = $restaurantModel->where('user_id', $user['id'])->first();

SELECT *
FROM `users`
WHERE `email` = 'restaurant@example.com'
 LIMIT 1
UPDATE `users` SET `reset_token` = 'd889c6379f6e455e92303b027b80107a', `reset_expires` = '2026-03-05 15:40:24', `updated_at` = '2026-03-05 14:40:24'
WHERE `users`.`id` IN ('2')
---
    public function sendReset()
    {
        $email = $this->request->getPost('email');

        if (! $email || ! filter_var($email, FILTER_VALIDATE_EMAIL)) {
            return redirect()->back()->withInput()->with('error', 'Please provide a valid email');
        }

        $user = $this->userModel->where('email', $email)->first();

        if (! $user) {
            // Do not reveal that the email is missing — keep generic message
            return redirect()->back()->with('success', 'If that email exists we sent a reset link');
        }

        $token = bin2hex(random_bytes(16));
        $expires = date('Y-m-d H:i:s', time() + 3600); // 1 hour

        $this->userModel->update($user['id'], [
            'reset_token'   => $token,
            'reset_expires' => $expires,
        ]);