app/Controllers/MenuItems.php

SELECT *
FROM `menu_items`
WHERE `restaurant_id` = '1'
---
    public function index()
    {
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'restaurant') {
            return redirect()->to('/login')->with('error', 'Unauthorized');
        }

        $restaurantId = $session->get('restaurant_id');
        $items = $this->menuItemModel->where('restaurant_id', $restaurantId)->findAll();