app/Controllers/Orders.php

SELECT *
FROM `orders`
WHERE `restaurant_id` = '1'
ORDER BY `created_at` DESC
---
    public function restaurantOrders()
    {
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'restaurant') {
            return redirect()->to('/login')->with('error', 'Unauthorized');
        }

        $restaurantId = $session->get('restaurant_id');

        // Get date filters from query string
        $startDate = $this->request->getGet('start_date');
        $endDate = $this->request->getGet('end_date');

        $builder = $this->orderModel->where('restaurant_id', $restaurantId);

        // Apply date filtering if provided
        if (!empty($startDate)) {
            $builder->where('created_at >=', $startDate . ' 00:00:00');
        }
        if (!empty($endDate)) {
            $builder->where('created_at <=', $endDate . ' 23:59:59');
        }

        $orders = $builder->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `orders`
WHERE `restaurant_id` = '1'
AND `status` IN ('completed','cancelled')
ORDER BY `created_at` DESC
---
    public function orderHistory()
    {
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'restaurant') {
            return redirect()->to('/login')->with('error', 'Unauthorized');
        }

        $restaurantId = $session->get('restaurant_id');

        // Get date filters from query string
        $startDate = $this->request->getGet('start_date');
        $endDate = $this->request->getGet('end_date');

        $builder = $this->orderModel->where('restaurant_id', $restaurantId);

        // Only show completed and cancelled orders
        $builder->whereIn('status', ['completed', 'cancelled']);

        // Apply date filtering if provided
        if (!empty($startDate)) {
            $builder->where('created_at >=', $startDate . ' 00:00:00');
        }
        if (!empty($endDate)) {
            $builder->where('created_at <=', $endDate . ' 23:59:59');
        }

        $orders = $builder->orderBy('created_at', 'DESC')->findAll();